; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_14_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 - counter
	)
  (:init
		(= (value c0) 59)
	(= (value c1) 12)
	(= (value c2) 20)
	(= (value c3) 11)
	(= (value c4) 46)
	(= (value c5) 32)
	(= (value c6) 61)
	(= (value c7) 21)
	(= (value c8) 98)
	(= (value c9) 3)
	(= (value c10) 79)
	(= (value c11) 20)
	(= (value c12) 37)
	(= (value c13) 33)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
		)
	)
)

; plan
1. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 6 of 13
2. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 6 of 13
3. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 6 of 13
4. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 6 of 13
5. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 6 of 13
6. (increment c13)
   changed: (value c13) from 33 to 36
   goals met: 6 of 13
7. (increment c13)
   changed: (value c13) from 36 to 39
   goals met: 7 of 13
8. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 7 of 13
9. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 7 of 13
10. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 7 of 13
11. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 7 of 13
12. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 7 of 13
13. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 7 of 13
14. (increase_rate c11)
   changed: (rate_value c11) from 5 to 6
   goals met: 7 of 13
15. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 7 of 13
16. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 7 of 13
17. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 7 of 13
18. (increase_rate c11)
   changed: (rate_value c11) from 6 to 7
   goals met: 7 of 13
19. (increase_rate c11)
   changed: (rate_value c11) from 7 to 8
   goals met: 7 of 13
20. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 7 of 13
21. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 7 of 13
22. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 7 of 13
23. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 7 of 13
24. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 7 of 13
25. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 7 of 13
26. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 7 of 13
27. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 7 of 13
28. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 7 of 13
29. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 7 of 13
30. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 7 of 13
31. (increment c3)
   changed: (value c3) from 11 to 16
   goals met: 7 of 13
32. (increment c3)
   changed: (value c3) from 16 to 21
   goals met: 8 of 13
33. (increase_rate c11)
   changed: (rate_value c11) from 8 to 9
   goals met: 8 of 13
34. (increment c11)
   changed: (value c11) from 20 to 29
   goals met: 8 of 13
35. (increment c11)
   changed: (value c11) from 29 to 38
   goals met: 7 of 13
36. (increment c11)
   changed: (value c11) from 38 to 47
   goals met: 7 of 13
37. (increment c11)
   changed: (value c11) from 47 to 56
   goals met: 7 of 13
38. (increase_rate c11)
   changed: (rate_value c11) from 9 to 10
   goals met: 7 of 13
39. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 7 of 13
40. (decrement c11)
   changed: (value c11) from 56 to 46
   goals met: 7 of 13
41. (decrement c10)
   changed: (value c10) from 79 to 74
   goals met: 7 of 13
42. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 7 of 13
43. (decrement c11)
   changed: (value c11) from 46 to 36
   goals met: 8 of 13
44. (decrement c10)
   changed: (value c10) from 74 to 68
   goals met: 8 of 13
45. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 8 of 13
46. (increment c11)
   changed: (value c11) from 36 to 46
   goals met: 7 of 13
47. (decrement c10)
   changed: (value c10) from 68 to 61
   goals met: 7 of 13
48. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 7 of 13
49. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 7 of 13
50. (increment c7)
   changed: (value c7) from 21 to 28
   goals met: 7 of 13
51. (increment c7)
   changed: (value c7) from 28 to 35
   goals met: 7 of 13
52. (increment c7)
   changed: (value c7) from 35 to 42
   goals met: 7 of 13
53. (increment c7)
   changed: (value c7) from 42 to 49
   goals met: 7 of 13
54. (increment c7)
   changed: (value c7) from 49 to 56
   goals met: 7 of 13
55. (increment c7)
   changed: (value c7) from 56 to 63
   goals met: 8 of 13
56. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 8 of 13
57. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 8 of 13
58. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 8 of 13
59. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 8 of 13
60. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 8 of 13
61. (increment c5)
   changed: (value c5) from 32 to 35
   goals met: 8 of 13
62. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 8 of 13
63. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 8 of 13
64. (increment c5)
   changed: (value c5) from 35 to 40
   goals met: 8 of 13
65. (increment c5)
   changed: (value c5) from 40 to 45
   goals met: 8 of 13
66. (increment c5)
   changed: (value c5) from 45 to 50
   goals met: 9 of 13
67. (decrement c11)
   changed: (value c11) from 46 to 36
   goals met: 10 of 13
68. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 10 of 13
69. (decrement c10)
   changed: (value c10) from 61 to 53
   goals met: 10 of 13
70. (increment c11)
   changed: (value c11) from 36 to 46
   goals met: 9 of 13
71. (decrement c10)
   changed: (value c10) from 53 to 45
   goals met: 10 of 13
72. (decrement c11)
   changed: (value c11) from 46 to 36
   goals met: 10 of 13
73. (decrement c10)
   changed: (value c10) from 45 to 37
   goals met: 10 of 13
74. (decrement c10)
   changed: (value c10) from 37 to 29
   goals met: 11 of 13
75. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 11 of 13
76. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 11 of 13
77. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 11 of 13
78. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 11 of 13
79. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 11 of 13
80. (increase_rate c9)
   changed: (rate_value c9) from 5 to 6
   goals met: 11 of 13
81. (increase_rate c9)
   changed: (rate_value c9) from 6 to 7
   goals met: 11 of 13
82. (increase_rate c9)
   changed: (rate_value c9) from 7 to 8
   goals met: 11 of 13
83. (increment c9)
   changed: (value c9) from 3 to 11
   goals met: 11 of 13
84. (increase_rate c9)
   changed: (rate_value c9) from 8 to 9
   goals met: 11 of 13
85. (increment c9)
   changed: (value c9) from 11 to 20
   goals met: 11 of 13
86. (increment c9)
   changed: (value c9) from 20 to 29
   goals met: 10 of 13
87. (increment c10)
   changed: (value c10) from 29 to 37
   goals met: 10 of 13
88. (increment c11)
   changed: (value c11) from 36 to 46
   goals met: 10 of 13
89. (increase_rate c9)
   changed: (rate_value c9) from 9 to 10
   goals met: 10 of 13
90. (increment c9)
   changed: (value c9) from 29 to 39
   goals met: 9 of 13
91. (increment c9)
   changed: (value c9) from 39 to 49
   goals met: 9 of 13
92. (increment c9)
   changed: (value c9) from 49 to 59
   goals met: 9 of 13
93. (increment c9)
   changed: (value c9) from 59 to 69
   goals met: 9 of 13
94. (increment c9)
   changed: (value c9) from 69 to 79
   goals met: 9 of 13
95. (increment c10)
   changed: (value c10) from 37 to 45
   goals met: 9 of 13
96. (increase_rate c10)
   changed: (rate_value c10) from 8 to 9
   goals met: 9 of 13
97. (increase_rate c10)
   changed: (rate_value c10) from 9 to 10
   goals met: 9 of 13
98. (increment c10)
   changed: (value c10) from 45 to 55
   goals met: 8 of 13
99. (increment c9)
   changed: (value c9) from 79 to 89
   goals met: 8 of 13
100. (decrement c11)
   changed: (value c11) from 46 to 36
   goals met: 9 of 13
101. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 9 of 13
102. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 9 of 13
103. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 9 of 13
104. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 9 of 13
105. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 9 of 13
106. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 9 of 13
107. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 9 of 13
108. (increment c1)
   changed: (value c1) from 12 to 19
   goals met: 9 of 13
109. (increment c1)
   changed: (value c1) from 19 to 26
   goals met: 8 of 13
110. (increment c1)
   changed: (value c1) from 26 to 33
   goals met: 8 of 13
111. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 8 of 13
112. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 8 of 13
113. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 8 of 13
114. (decrement c1)
   changed: (value c1) from 33 to 25
   goals met: 8 of 13
115. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 8 of 13
116. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 8 of 13
117. (increment c1)
   changed: (value c1) from 25 to 35
   goals met: 8 of 13
118. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 8 of 13
119. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 8 of 13
120. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 8 of 13
121. (increment c2)
   changed: (value c2) from 20 to 23
   goals met: 7 of 13
122. (increment c3)
   changed: (value c3) from 21 to 26
   goals met: 8 of 13
123. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 8 of 13
124. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 8 of 13
125. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 8 of 13
126. (decrement c0)
   changed: (value c0) from 59 to 54
   goals met: 8 of 13
127. (decrement c0)
   changed: (value c0) from 54 to 49
   goals met: 8 of 13
128. (decrement c0)
   changed: (value c0) from 49 to 44
   goals met: 8 of 13
129. (decrement c0)
   changed: (value c0) from 44 to 39
   goals met: 8 of 13
130. (decrement c0)
   changed: (value c0) from 39 to 34
   goals met: 9 of 13
131. (increment c2)
   changed: (value c2) from 23 to 26
   goals met: 8 of 13
132. (increment c3)
   changed: (value c3) from 26 to 31
   goals met: 9 of 13
133. (decrement c1)
   changed: (value c1) from 35 to 25
   goals met: 9 of 13
134. (decrement c0)
   changed: (value c0) from 34 to 29
   goals met: 9 of 13
135. (decrement c0)
   changed: (value c0) from 29 to 24
   goals met: 10 of 13
136. (decrement c9)
   changed: (value c9) from 89 to 79
   goals met: 10 of 13
137. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 10 of 13
138. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 10 of 13
139. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 10 of 13
140. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 10 of 13
141. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 10 of 13
142. (increment c9)
   changed: (value c9) from 79 to 89
   goals met: 10 of 13
143. (decrement c8)
   changed: (value c8) from 98 to 93
   goals met: 10 of 13
144. (decrement c8)
   changed: (value c8) from 93 to 88
   goals met: 11 of 13
145. (increment c11)
   changed: (value c11) from 36 to 46
   goals met: 10 of 13
146. (increment c10)
   changed: (value c10) from 55 to 65
   goals met: 10 of 13
147. (decrement c9)
   changed: (value c9) from 89 to 79
   goals met: 9 of 13
148. (decrement c8)
   changed: (value c8) from 88 to 83
   goals met: 9 of 13
149. (decrement c8)
   changed: (value c8) from 83 to 78
   goals met: 10 of 13
150. (increment c10)
   changed: (value c10) from 65 to 75
   goals met: 10 of 13
151. (decrement c11)
   changed: (value c11) from 46 to 36
   goals met: 11 of 13
152. (decrement c9)
   changed: (value c9) from 79 to 69
   goals met: 11 of 13
153. (decrement c8)
   changed: (value c8) from 78 to 73
   goals met: 11 of 13
154. (decrement c8)
   changed: (value c8) from 73 to 68
   goals met: 12 of 13
155. (increment c11)
   changed: (value c11) from 36 to 46
   goals met: 11 of 13
156. (decrement c10)
   changed: (value c10) from 75 to 65
   goals met: 10 of 13
157. (decrement c9)
   changed: (value c9) from 69 to 59
   goals met: 10 of 13
158. (decrement c8)
   changed: (value c8) from 68 to 63
   goals met: 9 of 13
159. (decrement c8)
   changed: (value c8) from 63 to 58
   goals met: 10 of 13
160. (decrement c7)
   changed: (value c7) from 63 to 56
   goals met: 10 of 13
161. (decrement c6)
   changed: (value c6) from 61 to 58
   goals met: 10 of 13
162. (decrement c6)
   changed: (value c6) from 58 to 55
   goals met: 11 of 13
163. (increment c11)
   changed: (value c11) from 46 to 56
   goals met: 11 of 13
164. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 11 of 13
165. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 11 of 13
166. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 11 of 13
167. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 11 of 13
168. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 11 of 13
169. (increment c12)
   changed: (value c12) from 37 to 42
   goals met: 10 of 13
170. (increment c13)
   changed: (value c13) from 39 to 42
   goals met: 10 of 13
171. (increment c13)
   changed: (value c13) from 42 to 45
   goals met: 11 of 13
172. (increment c12)
   changed: (value c12) from 42 to 47
   goals met: 10 of 13
173. (increment c13)
   changed: (value c13) from 45 to 48
   goals met: 11 of 13
174. (increment c12)
   changed: (value c12) from 47 to 52
   goals met: 10 of 13
175. (increment c12)
   changed: (value c12) from 52 to 57
   goals met: 11 of 13
176. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 11 of 13
177. (increase_rate c13)
   changed: (rate_value c13) from 4 to 5
   goals met: 11 of 13
178. (increment c13)
   changed: (value c13) from 48 to 53
   goals met: 11 of 13
179. (increment c13)
   changed: (value c13) from 53 to 58
   goals met: 12 of 13
180. (increment c11)
   changed: (value c11) from 56 to 66
   goals met: 12 of 13
181. (increment c12)
   changed: (value c12) from 57 to 62
   goals met: 11 of 13
182. (increment c13)
   changed: (value c13) from 58 to 63
   goals met: 12 of 13
183. (increment c12)
   changed: (value c12) from 62 to 67
   goals met: 12 of 13
184. (increment c13)
   changed: (value c13) from 63 to 68
   goals met: 13 of 13
